{
  "2024-3-14": [
    [
      "2024-03-14 10:25PM",
      "DP Daybreak | Inside Mackenzie Fierceton's lawsuit"
    ],
    [
      "2024-03-14 10:25PM",
      "Quaker Nation | A new champ in town"
    ],
    [
      "2024-03-14 10:25PM",
      "Submit your tip confidentially and securely to the DP"
    ],
    [
      "2024-03-14 10:25PM",
      "Annenberg Public Policy Center study finds polarized views of Supreme Court after Dobbs decision"
    ],
    [
      "2024-03-14 10:25PM",
      "DP Daybreak | Inside Mackenzie Fierceton's lawsuit"
    ],
    [
      "2024-03-14 10:25PM",
      "Excerpts of depositions from Penn admin. offer new insight into Mackenzie Fierceton lawsuit"
    ],
    [
      "2024-03-14 10:25PM",
      "Penn Med researchers awarded grant to train learning health system scientists"
    ],
    [
      "2024-03-14 10:25PM",
      "Carrie Hutnick appointed new executive director of Civic House, Penn Civic Scholars Program"
    ],
    [
      "2024-03-14 10:25PM",
      "Penn Medicine joins White House voluntary commitments on AI use in healthcare "
    ],
    [
      "2024-03-14 10:25PM",
      "Nine Penn affiliates selected as 2024 Thouron Scholars to study in the United Kingdom"
    ],
    [
      "2024-03-14 10:25PM",
      "DP Daybreak | Discrimination allegations in Penn Med program"
    ],
    [
      "2024-03-14 10:25PM",
      "U.S. House committee grills special counsel on classified documents found at Penn Biden Center"
    ],
    [
      "2024-03-14 10:25PM",
      "Students allege discrimination within Penn Med master's program, prompting investigation"
    ],
    [
      "2024-03-14 10:25PM",
      "Two new plaintiffs join amended lawsuit against Penn over antisemitism on campus"
    ],
    [
      "2024-03-14 10:25PM",
      "Pulitzer Prize-winning journalists Maureen Dowd, Ashley Parker speak at Kelly Writers House"
    ],
    [
      "2024-03-14 10:25PM",
      "Wellness at Penn, MERT host Narcan administration training event"
    ],
    [
      "2024-03-14 10:25PM",
      "DP Daybreak | Faculty sue Penn for 'McCarthyism'"
    ],
    [
      "2024-03-14 10:25PM",
      "Penn graduate student workers release union bargaining survey amid fight for increased stipend"
    ],
    [
      "2024-03-14 10:25PM",
      "Faculty group sues Penn over 'McCarthyism,' aiming to stop transfer of University documents to Congress"
    ],
    [
      "2024-03-14 10:25PM",
      "1963 Wharton graduate Stuart Weitzman reflects on philanthropy amid donor backlash over antisemitism"
    ],
    [
      "2024-03-14 10:25PM",
      "Penn initiative awards funding for five new health and safety research projects in Philadelphia"
    ],
    [
      "2024-03-14 10:25PM",
      "Penn researchers to expand student team for work on NASA space telescope project"
    ],
    [
      "2024-03-14 10:25PM",
      "DP Daybreak | Who governs Penn?"
    ]
  ]
}